Revit 2024 API
UIApplication.DisplayingOptionsDialog Event
 Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public event EventHandler<DisplayingOptionsDialogEventArgs> DisplayingOptionsDialog
Visual Basic
Public Event DisplayingOptionsDialog As EventHandler(Of DisplayingOptionsDialogEventArgs)
Visual C++
public:
 event EventHandler<DisplayingOptionsDialogEventArgs^>^ DisplayingOptionsDialog {
	void add (EventHandler<DisplayingOptionsDialogEventArgs^>^ value);
	void remove (EventHandler<DisplayingOptionsDialogEventArgs^>^ value);
}
See Also
UIApplication Class
Autodesk.Revit.UI Namespace